&НаСервере
Процедура ЗН_ПодключитьВнешнююОбработкуНаСервере()
	ВнешниеОбработки.Подключить("v8res://mngbase/StandardFindByReference.epf", "StandardFindByRef", false);
КонецПроцедуры

&НаКлиенте
Процедура ЗН_ОткрытьПоискСсылокПосле(Команда)
	ЗН_ПодключитьВнешнююОбработкуНаСервере();
    ОткрытьФорму("ВнешняяОбработка.StandardFindByRef.Форма");
КонецПроцедуры 

// https://infostart.ru/1c/articles/369487/ Недокументированное использование стандартных обработок
// https://infostart.ru/1c/articles/1701302/	Ошибка при открытии StandardFindByRef.epf (описание и решение)
