//	Перед добавлением нового реквизита на форму
//  Нужно добавить в запрос динамического списка 
//  Эти ревизиты

&НаСервере
Процедура ЗН_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	
	ТекстЗапроса = ""; 
	
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса; 
	СвойстваСписка.ОсновнаяТаблица = Список.ОсновнаяТаблица;
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
	
	Эл = Элементы.Вставить("Замена", Тип("ПолеФормы"), Элементы.Список);
	Эл.Заголовок = "Замена";
	Эл.ПутьКДанным = "Список.Замена";
	
	Эл = Элементы.Вставить("Размер", Тип("ПолеФормы"), Элементы.Список);
	Эл.Заголовок = "Размер";
	Эл.ПутьКДанным = "Список.Размер";
КонецПроцедуры
