
&НаСервере
Процедура ВыгрузитьНаСервере()
	Путь = "C:\Users\Администратор\Desktop\НастройкиОтчета.txt";
	МассивДляСохранения = новый Массив;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПрочееОприходованиеТоваров.Ссылка КАК Ссылка,
						  | ПрочееОприходованиеТоваров.Сервис_СуммаДокумента КАК СуммаДокумента,
						  | ПрочееОприходованиеТоваров.Сервис_ВходящийНомер КАК ВходящийНомер
						  |ИЗ
	                      |	Документ.ПрочееОприходованиеТоваров КАК ПрочееОприходованиеТоваров"); 
	Результат = Запрос.Выполнить().Выгрузить();	
	МассивДляСохранения.Добавить(Результат);

	ЗначениеВФайл(Путь, МассивДляСохранения);
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда) 
	ВыгрузитьНаСервере();
КонецПроцедуры 

&НаСервере
Процедура ЗагрузитьНаСервере()
	Путь = "C:\Users\Администратор\Desktop\НастройкиОтчета.txt";
	ИмяФ = Новый Файл(Путь);
	Если ИмяФ.Существует() Тогда
	    Попытка
	        ПолученныйМассив = ЗначениеИзФайла(Путь)[0];
			Для Каждого Запись из ПолученныйМассив Цикл
				Ссылка = Запись.Ссылка.ПолучитьОбъект();
				Если Ссылка <> Неопределено Тогда
					Ссылка.Сервис_СуммаДокумента = Запись.СуммаДокумента;
					Ссылка.Сервис_ВходящийНомер = Запись.ВходящийНомер;
					Попытка
						Ссылка.Записать(РежимЗаписиДокумента.Запись);
					Исключение
					КонецПопытки
				КонецЕсли;
			КонецЦикла;
	    исключение
	        Сообщить("Загрузка не удалась");
	    конецпопытки;
	конецесли;	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры
